<?php

return [
    'name'           => 'File',
    /*
    |--------------------------------------------------------------------------
    |  Модели в модуле
    |--------------------------------------------------------------------------
    */
    'model'          => [
        'Extension'   => 'extensions',
        'File'        => 'files',
        'Fileable'    => 'fileables',
        'FileVersion' => 'file_versions',
    ],
    /*
    |--------------------------------------------------------------------------
    |  Типы файлов для проекта,
    | !!! уникальное расширение только в одном типе файлов
    |--------------------------------------------------------------------------
    */
    'type'           => [
        'audio'         => ['mp3'],
        'books'         => ['fb2.zip', 'fb2', 'epub'],
        'documents'     => ['doc', 'docx', 'rtf', 'xls', 'xlsx', 'txt', 'pdf'],
        'images'        => ['jpg', 'webp', 'jpeg', 'gif', 'png', 'bmp'],
        'video'         => ['avi', 'mp4', 'mkv', 'wmv', 'mpeg'],
        'presentations' => ['ppt', 'pptx'],
    ],
    /*
    |--------------------------------------------------------------------------
    |  Данные для автоматического удаления старых (мягко удаленных) записей в таблицах
    |--------------------------------------------------------------------------
    |   day - количество дней хранения
    |   limit - количество записей, удаляемых за один проход
    */
    'cleaning'       => [
        'File'        => [
            'day'   => 30,
            'limit' => 300,
        ],
        'FileVersion' => [
            'day'   => 30,
            'limit' => 300,
        ],
    ],

    /*
     |--------------------------------------------------------------------------
     | префиксы (размеры изображений, сжатие) для вариантов изображений
     |--------------------------------------------------------------------------
     |   prefixes_model => [
     |    'alias'    - имя модели (маленькими буквами)
     |       [
     |       'width'    - макс. ширина изображения
     |       'height'   - макс. высота изображения
     |       'quality'  - процент сжатия
     |       'prefix'   - префикс для подстановки в имя файла
     |       ],
     |   ],
     */
    // todo проблемы с новыми размерами, на каком этапе генерация новых размеров,
    //  - введение картинок с новыми размерами для новой верстки
    //  - как избавляться от устаревших картинок
    //  - как вводить новые размеры в конфиг, не ломая старые размеры
    'prefixes_model' => [
        'file' => [
            'xs' => [
                'width'   => 160,
                'height'  => 90,
                'quality' => 80,
                'prefix'  => '160x90',
            ],
            'sm' => [
                'width'   => 368,
                'height'  => 207,
                'quality' => 80,
                'prefix'  => '368x207',
            ],
            'md' => [
                'width'   => 368,
                'height'  => 207,
                'quality' => 80,
                'prefix'  => '368x207',
            ],
            'lg' => [
                'width'   => 960,
                'height'  => 540,
                'quality' => 90,
                'prefix'  => '960x540',
            ],
        ],
    ],
    // размеры файлов заглушек
    'plug_sizes'     => [
        'file' => [
            'lg' => [
                'width'  => 960,
                'height' => 540,
            ],
            'md' => [
                'width'  => 368,
                'height' => 207,
            ],
            'sm' => [
                'width'  => 368,
                'height' => 207,
            ],
            'xs' => [
                'width'  => 160,
                'height' => 90,
            ],
        ],
    ],

    // todo надо переделать, как?

    //  сущности, в которых допускается только один файл (картинка), старые удаляются
    'one_file'       => [
        'Version',
        'Person',
        'User',
    ],
];